Hi, Sorry for reopening this issue. Despite successful test n Staging, in Production environment I have issues to update `b_end` `ordered_vlan` for VXC plugged to Megaport Port.

Can you take a look 

Terraform plan:
```
Terraform will perform the following actions:
  # module.megaport-lbo.megaport_vxc.ipxgrx[0] will be updated in-place
  ~ resource "megaport_vxc" "ipxgrx" {
      ~ a_end                = {
          ~ current_product_uid   = "9bcebf3c-2d3a-43a2-9bd3-21fb588ceda6" -> (known after apply)
          ~ location              = "Equinix PA2/3" -> (known after apply)
          ~ location_id           = 515 -> (known after apply)
          + ordered_vlan          = (known after apply)
          ~ product_name          = "LBO-EU-Paris-ICSS-MVE" -> (known after apply)
          ~ vlan                  = 821 -> (known after apply)
            # (5 unchanged attributes hidden)
        }
      ~ b_end                = {
          ~ current_product_uid   = "91a9f364-46d1-404d-b459-b459e3e2cfa1" -> (known after apply)
          + inner_vlan            = (known after apply)
          ~ location              = "Equinix PA2/3" -> (known after apply)
          ~ location_id           = 515 -> (known after apply)
          + ordered_vlan          = [100](https://gitlab.com/1nce-tech/platform/base-services/infra/terraform/external-network/megaport/-/jobs/7992762747#L100)
          ~ product_name          = "LBO-EU-Paris-ICSS-Port" -> (known after apply)
          ~ vlan                  = 100 -> (known after apply)
            # (4 unchanged attributes hidden)
        }
      ~ contract_end_date    = "Saturday, 26-Oct-24 14:00:00 UTC" -> (known after apply)
      ~ contract_start_date  = "Thursday, 26-Sep-24 14:22:30 UTC" -> (known after apply)
      ~ create_date          = "Thursday, 26-Sep-24 14:10:34 UTC" -> (known after apply)
      + csp_connections      = (known after apply)
      ~ last_updated         = "Friday, 04-Oct-24 07:38:02 UTC" -> (known after apply)
      ~ live_date            = "Thursday, 26-Sep-24 14:22:30 UTC" -> (known after apply)
      ~ provisioning_status  = "LIVE" -> (known after apply)
        # (19 unchanged attributes hidden)
    }
Plan: 0 to add, 1 to change, 0 to destroy.
```

Terraform apply:
```
module.megaport-lbo.megaport_vxc.ipxgrx[0]: Still modifying... [30s elapsed]
╷
│ Error: Provider produced inconsistent result after apply
│ 
│ When applying changes to module.megaport-lbo.megaport_vxc.ipxgrx[0],
│ provider
│ "module.megaport-lbo.provider[\"registry.terraform.io/megaport/megaport\"]"
│ produced an unexpected new value: .b_end.ordered_vlan: was
│ cty.NumberIntVal(100), but now null.
│ 
│ This is a bug in the provider, which should be reported in the provider's
│ own issue tracker.
╵
```